<template>
  <div class="main-container flex-column" style="display:flex;">
    <common-header class="w-100 position-fixed" style="z-index: 1000"/>

    <div class="web-bg " :style="bgstyle"></div>
    <h3 class="title mb-3" style="text-align: left">SpringBoot学习笔记</h3>
    <div style="width: 100%;">
      <div class="content row justify-content-center w-100 m-0" >
        <!--    <div></div>-->
        <div class="col-md-10 col-xxl-8">
          <div style="background:#fff;padding: 40px;box-shadow: 0px 0px 30px rgba(107,74,82,0.39);
              border-radius: 2px;min-height: 500px">
            <p>
              {{articleContent}}
            </p>
            <comment-area/>
          </div>
        </div>
        

      </div>
      <common-footer style="margin-top: 30px"/>
    </div>

  </div>
</template>

<script>
import CommonHeader from "@/components/CommonHeader";
import CommonFooter from "@/components/CommonFooter";
import CommentArea from "@/components/CommentArea";

export default {
  name: "Article",
  components: {
    CommonHeader: CommonHeader,
    CommonFooter: CommonFooter,
    CommentArea: CommentArea

  },
  data() {
    return {
      backgroundImage: require('@/assets/79008828_p0.jpg'),
      bgstyle: {
        backgroundImage: 'url(' + require('@/assets/9888608.png') + ')',
      },
      articleContent:"\n" +
          "            回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是一款功能强\n" +
          "            大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款\n" +
          "            功能强大的原型设计工具。回复@游客：原型助手是一款功能强大的原型设计工具\n" +
          "            。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计\n" +
          "            工具。原型助手是一款功能强大的原型设计工具。回复@游客：原型助手是一款功能\n" +
          "            强大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款\n" +
          "            功能强大的原型设计工具。原型助手是一款功能强大的原型设计工具。回复@游客：\n" +
          "            原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计工\n" +
          "            具。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计\n" +
          "            工具。回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是一款功能强\n" +
          "            的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大\n" +
          "            的原型设计工具。回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是\n" +
          "            一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是\n" +
          "            一款功能强大的原型设计工具。\n" +
          "            回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是一款功能强\n" +
          "            大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款\n" +
          "            功能强大的原型设计工具。回复@游客：原型助手是一款功能强大的原型设计工具\n" +
          "            。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计\n" +
          "            工具。原型助手是一款功能强大的原型设计工具。回复@游客：原型助手是一款功能\n" +
          "            强大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款\n" +
          "            功能强大的原型设计工具。原型助手是一款功能强大的原型设计工具。回复@游客：\n" +
          "            原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计工\n" +
          "            具。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计\n" +
          "            工具。回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是一款功能强\n" +
          "            的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大\n" +
          "            的原型设计工具。回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是\n" +
          "            一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是\n" +
          "            一款功能强大的原型设计工具。\n" +
          "            回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是一款功能强\n" +
          "            大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款\n" +
          "            功能强大的原型设计工具。回复@游客：原型助手是一款功能强大的原型设计工具\n" +
          "            。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计\n" +
          "            工具。原型助手是一款功能强大的原型设计工具。回复@游客：原型助手是一款功能\n" +
          "            强大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款\n" +
          "            功能强大的原型设计工具。原型助手是一款功能强大的原型设计工具。回复@游客：\n" +
          "            原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计工\n" +
          "            具。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计\n" +
          "            工具。回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是一款功能强\n" +
          "            的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大\n" +
          "            的原型设计工具。回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是\n" +
          "            一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是\n" +
          "            一款功能强大的原型设计工具。\n" +
          "            回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是一款功能强\n" +
          "            大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款\n" +
          "            功能强大的原型设计工具。回复@游客：原型助手是一款功能强大的原型设计工具\n" +
          "            。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计\n" +
          "            工具。原型助手是一款功能强大的原型设计工具。回复@游客：原型助手是一款功能\n" +
          "            强大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款\n" +
          "            功能强大的原型设计工具。原型助手是一款功能强大的原型设计工具。回复@游客：\n" +
          "            原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计工\n" +
          "            具。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计\n" +
          "            工具。回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是一款功能强\n" +
          "            的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大\n" +
          "            的原型设计工具。回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是\n" +
          "            一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是\n" +
          "            一款功能强大的原型设计工具。\n" +
          "            回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是一款功能强\n" +
          "            大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款\n" +
          "            功能强大的原型设计工具。回复@游客：原型助手是一款功能强大的原型设计工具\n" +
          "            。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计\n" +
          "            工具。原型助手是一款功能强大的原型设计工具。回复@游客：原型助手是一款功能\n" +
          "            强大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款\n" +
          "            功能强大的原型设计工具。原型助手是一款功能强大的原型设计工具。回复@游客：\n" +
          "            原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计工\n" +
          "            具。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计\n" +
          "            工具。回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是一款功能强\n" +
          "            的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大\n" +
          "            的原型设计工具。回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是\n" +
          "            一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是\n" +
          "            一款功能强大的原型设计工具。\n" +
          "            回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是一款功能强\n" +
          "            大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款\n" +
          "            功能强大的原型设计工具。回复@游客：原型助手是一款功能强大的原型设计工具\n" +
          "            。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计\n" +
          "            工具。原型助手是一款功能强大的原型设计工具。回复@游客：原型助手是一款功能\n" +
          "            强大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款\n" +
          "            功能强大的原型设计工具。原型助手是一款功能强大的原型设计工具。回复@游客：\n" +
          "            原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计工\n" +
          "            具。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计\n" +
          "            工具。回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是一款功能强\n" +
          "            的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是一款功能强大\n" +
          "            的原型设计工具。回复@游客：原型助手是一款功能强大的原型设计工具。原型助手是\n" +
          "            一款功能强大的原型设计工具。原型助手是一款功能强大的原型设计工具。原型助手是\n" +
          "            一款功能强大的原型设计工具。"
    }
  },
  methods: {}
}
</script>

<style scoped>
.web-bg {
  position: fixed;
  z-index: -999;
  width: 100%;
  height: 100%;
  background: url(https://pic1.rpgsky.net/imgcn/2020/11/28/2c4da137c8111983b5be3707ef53980c.png);
  background-attachment: local;
  background-position: center;
  -webkit-background-size: cover;
  -moz-background-size: cover;
  background-size: cover;
  background-repeat: no-repeat;
}

.title {
  font-size: 40px;
  font-family: 宋体, serif;
  color: #3f001c;
  font-weight: lighter;
  margin-left: 10%;
  margin-top: 160px;
  /*margin-top: 3px;*/
}

div {
  font-family: Arial, serif;
}
</style>
